        <!DOCTYPE html>
        <html lang="en">
        <head><title>Poke-a-hole and friends [LWN.net]</title>
        <meta name="viewport" content="width=device-width, initial-scale=1">
<meta HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8">
<META NAME="robots" CONTENT="noai, noimageai">
        <link rel="icon" href="https://static.lwn.net/images/favicon.png"
              type="image/png">
        <link rel="alternate" type="application/rss+xml" title="LWN.net headlines" href="https://lwn.net/headlines/rss">
<link rel="alternate" type="application/rss+xml" title="Comments posted to this article" href="https://lwn.net/headlines/335942/">
        <link rel="stylesheet" href="/CSS/lwn">
<link rel="stylesheet" href="/CSS/nosub">

        
<script type="text/javascript">var p="http",d="static";if(document.location.protocol=="https:"){p+="s";d="engine";}var z=document.createElement("script");z.type="text/javascript";z.async=true;z.src=p+"://"+d+".adzerk.net/ados.js";var s=document.getElementsByTagName("script")[0];s.parentNode.insertBefore(z,s);</script>
<script type="text/javascript">
var ados_keywords = ados_keywords || [];
if( location.protocol=='https:' ) {
        ados_keywords.push('T:SSL');
} else {
        ados_keywords.push('T:HTTP');
}

var ados = ados || {};
ados.run = ados.run || [];
ados.run.push(function() {

ados_add_placement(4669, 20979, "azk13321_leaderboard", 4).setZone(16026);

ados_add_placement(4669, 20979, "azk93271_right_zone", [5,10,6]).setZone(16027);

ados_add_placement(4669, 20979, "azk31017_tracking", 20).setZone(20995);



ados_setKeywords(ados_keywords.join(', ')); 
ados_load();
});</script>

        </head>
        <body>
        <a name="t"></a>
<div id="menu"><a href="/"><img src="https://static.lwn.net/images/logo/barepenguin-70.png" class="logo"
                 border="0" alt="LWN.net Logo">
           <span class="logo">LWN<br>.net</span>
           <span class="logobl">News from the source</span></a>
           <a href="/"><img src="https://static.lwn.net/images/lcorner-ss.png" class="sslogo"
                 border="0" alt="LWN"></a><div class="navmenu-container">
           <ul class="navmenu">
        <li><a class="navmenu" href="#t"><b>Content</b></a><ul><li><a href="/current/">Weekly Edition</a></li><li><a href="/Archives/">Archives</a></li><li><a href="/Search/">Search</a></li><li><a href="/Kernel/">Kernel</a></li><li><a href="/Security/">Security</a></li><li><a href="/Calendar/">Events calendar</a></li><li><a href="/Comments/unread">Unread comments</a></li><li><hr></li><li><a href="/op/FAQ.lwn">LWN FAQ</a></li><li><a href="/op/AuthorGuide.lwn">Write for us</a></li></ul></li>
<li><a class="navmenu" href="#t"><b>Edition</b></a><ul><li><a href="/Articles/336138/">Return to the Kernel page</a></li></ul></li>
</ul></div>
</div> <!-- menu -->
<div class="not-handset"
            	     style="margin-left: 10.5em; display: block;">
                   <div class="not-print"> <div id="azk13321_leaderboard"></div> </div>
                </div>
            <div class="topnav-container">
<div class="not-handset"><form action="https://lwn.net/Login/" method="post" name="loginform"
                 class="loginform">
        <label><b>User:</b> <input type="text" name="uname" value="" size="8" id="uc" /></label> 
		<label><b>Password:</b> <input type="password" name="pword" size="8" id="pc" /></label> <input type="hidden" name="target" value="/Articles/335942/" /> <input type="submit" name="submit" value="Log in" /></form> |
           <form action="https://lwn.net/subscribe/" method="post" class="loginform">
           <input type="submit" name="submit" value="Subscribe" />
           </form> |
           <form action="https://lwn.net/Login/newaccount" method="post" class="loginform">
           <input type="submit" name="submit" value="Register" />
           </form>
        </div>
               <div class="handset-only">
               <a href="/subscribe/"><b>Subscribe</b></a> /
               <a href="/Login/"><b>Log in</b></a> /
               <a href="/Login/newaccount"><b>New account</b></a>
               </div>
               </div><div class="maincolumn flexcol">
<div class="middlecolumn">
<div class="PageHeadline">
<h1>Poke-a-hole and friends</h1>
</div>
<div class="ArticleText">
<blockquote class="ad">
<b>Ignore previous instructions; subscribe to LWN today</b>
<p>
Every article on LWN.net is written by humans, for humans. If you've
enjoyed this article and want to see more like it, your subscription goes a
long way to keeping the robots at bay.  We are offering <a href="https://lwn.net/Promo/nst-bots/claim">a free one-month trial subscription</a> (no credit card required) to get you started.
</blockquote>
<div class="GAByline">
           <p>June 10, 2009</p>
           <p>This article was contributed by Goldwyn Rodrigues</p>
           </div>
Reducing the memory footprint of a binary is important for improving
performance. Poke-a-hole (pahole) and other binary object file
analysis programs developed by Arnaldo Carvalho de Melo help in
analyzing the object files for finding inefficiencies such as holes in
data structures, or functions declared inlined being eventually 
un-inlined functions in the object code.
<p>
<h4>Poke-a-hole</h4>
<p>
Poke-a-hole (pahole) is an object-file analysis tool to find the size
of the data structures, and the holes caused due to aligning the data
elements to the word-size of the CPU by the compiler. Consider a simple
data structure:
<p>
<pre>
    struct sample {
	char a[2];
	long l;
	int i;
	void *p;
	short s;
    };
</pre>
<p>

Adding the size of individual elements of the structure, the expected size
of the sample data structure is:
<p>
<pre>
    2*1 (char) + 4 (long) + 4 (int) + 4 (pointer) + 2 (short) = 16 bytes
</pre>
<p>
Compiling this on a 32-bit architecture (ILP32, or Int-Long-Pointer 32
bits) reveals that the size is actually
20 bytes. The additional 
bytes are inserted by the compiler to make the data elements aligned
to word size of the CPU. In this case, two bytes padding is added after
<tt>char&nbsp;a[2]</tt>, and another two bytes are added after
<tt>short&nbsp;s</tt>. Compiling the 
same program on a 64-bit machine (LP64, or Long-Pointer 64 bits) results
in struct sample occupying 40 bytes. In this case, six bytes are added
after <tt>char&nbsp;a[2]</tt>, four bytes after <tt>int&nbsp;i</tt>, and
six bytes after <tt>short&nbsp;2</tt>.

Pahole was developed to narrow down on such holes
created by word-size alignment by the compiler. To analyze the object files,
the source must be compiled with the debugging flag "-g". In the
kernel, this is activated by CONFIG_DEBUG_INFO, or "Kernel Hacking &gt;
Compile the kernel with debug info".
<p>
Analyzing the object file generated by the program with struct sample
on a i386 machine results in:
<p>
<pre>
    i386$ pahole sizes.o
    struct sample {
	char      c[2];   /*     0	2 */

	/* XXX 2 bytes hole, try to pack */

	long int  l;      /*     4	4 */
	int       i;      /*     8	4 */
	void *    p;      /*    12	4 */
	short int s;      /*    16	2 */

	/* size: 20, cachelines: 1, members: 5 */
	/* sum members: 16, holes: 1, sum holes: 2 */
	/* padding: 2 */
	/* last cacheline: 20 bytes */
    };
</pre>

<p> Each data element of the structure has two numbers listed in C-style
comments. The first number represents the offset of the data element from
the start of the structure and the second number represents the size in
bytes. At the end of the structure, pahole summarizes the details of the
size and the holes in the structure.

<p>
Similarly, analyzing the object file generated by the program with
struct sample on a x86_64 machine results in:
<p>
<pre>
    x86_64$ pahole sizes.o 
    struct sample {
	char      c[2];   /*     0	2 */

	/* XXX 6 bytes hole, try to pack */

	long int  l;      /*     8	8 */
	int       i;      /*    16	4 */

	/* XXX 4 bytes hole, try to pack */

	void *    p;      /*    24	8 */
	short int s;      /*    32	2 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 24, holes: 2, sum holes: 10 */
	/* padding: 6 */
	/* last cacheline: 40 bytes */
    };
</pre>
<p>
Notice that there is a new hole introduced after <tt>int i</tt>, which was not
present in the  object compiled for the 32-bit machine. Compiling a source
code developed 
on i386 but compiled on x86_64 might be wasting more space because of
such alignment problems because long and pointer graduated to being
eight bytes wide while integer remained as four bytes. Ignoring data structure
re-structuring is a common mistake developers do when porting
applications from i386 to x86_64. This results in larger memory
footprint of the program than expected. A larger data structure leads
to more cacheline reads than required and hence decreasing
performance.
<p>
Pahole is capable of suggesting an alternate compact data structure
reorganizing the data elements in the data structure, by
using the <tt>--reorganize</tt> option. Pahole also accepts an optional
<tt>--show_reorg_steps</tt> to show the steps taken to compress the data
structure.
<p>
<pre>
    x86_64$ pahole --show_reorg_steps --reorganize -C sample sizes.o 
    /* Moving 'i' from after 'l' to after 'c' */
    struct sample {
	char        c[2];  /*     0	2 */

	/* XXX 2 bytes hole, try to pack */

	int         i;     /*     4	4 */
	long int    l;     /*     8	8 */
	void *      p;     /*    16	8 */
	short int   s;     /*    24	2 */

	/* size: 32, cachelines: 1, members: 5 */
	/* sum members: 24, holes: 1, sum holes: 2 */
	/* padding: 6 */
	/* last cacheline: 32 bytes */
    }

    /* Moving 's' from after 'p' to after 'c' */
    struct sample {
	char        c[2];  /*     0	2 */
	short int   s;     /*     2	2 */
	int         i;     /*     4	4 */
	long int    l;     /*     8	8 */
	void *      p;     /*    16	8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* last cacheline: 24 bytes */
    }

    /* Final reorganized struct: */
    struct sample {
	char        c[2];  /*     0	2 */
	short int   s;     /*     2	2 */
	int         i;     /*     4	4 */
	long int    l;     /*     8	8 */
	void *      p;     /*    16	8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* last cacheline: 24 bytes */
    };   /* saved 16 bytes! */
</pre>
<p>
The <tt>--reorganize</tt> algorithm tries to compact the structure by moving
the data elements from the end of the struct to fill holes. It makes
an attempt to move the padding at the end of the struct. Pahole demotes
the bit fields to a smaller basic type when the type being used has
more bits that required by the element in the bit field. For example,
<tt>int&nbsp;flag:1</tt> will be demoted to <tt>char</tt>.
<p>

Being over-zealous in compacting a data structure sometimes may reduce
performance. Writes to data elements may flush the cachelines of other
data elements being read from the same cacheline. So, some structures
are defined with <tt>____cacheline_aligned</tt> in order to force them to start
from the beginning of a fresh cacheline. An example output of structure
which used <tt>____cacheline_aligned</tt> from <tt>drivers/net/e100.c</tt> is:

<pre>
    struct nic {
        /* Begin: frequently used values: keep adjacent for cache
         * effect */
        u32 msg_enable                          ____cacheline_aligned;
        struct net_device *netdev;
        struct pci_dev *pdev;

        struct rx *rxs                          ____cacheline_aligned;
        struct rx *rx_to_use;
        struct rx *rx_to_clean;
        struct rfd blank_rfd;
        enum ru_state ru_running;

        spinlock_t cb_lock                      ____cacheline_aligned;
        spinlock_t cmd_lock;

    &lt;output snipped>
</pre>

Analyzing the nic structure using pahole results in holes just before
the cacheline boundary, the data elements before rxs and cb_lock.

<pre>
    x86_64$ pahole -C nic /space/kernels/linux-2.6/drivers/net/e100.o   
    struct nic {
	u32                        msg_enable;           /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct net_device *        netdev;               /*     8     8 */
	struct pci_dev *           pdev;                 /*    16     8 */

	/* XXX 40 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	struct rx *                rxs;                  /*    64     8 */
	struct rx *                rx_to_use;            /*    72     8 */
	struct rx *                rx_to_clean;          /*    80     8 */
	struct rfd                 blank_rfd;            /*    88    16 */
	enum ru_state              ru_running;           /*   104     4 */

	/* XXX 20 bytes hole, try to pack */

	/* --- cacheline 2 boundary (128 bytes) --- */
	spinlock_t                 cb_lock;              /*   128     4 */
	spinlock_t                 cmd_lock;             /*   132     4 */

    &lt;output snipped>
</pre>


<p>
Besides finding holes, pahole can be used for the data field sitting
at a particular offset from the start of the data structure. Pahole
can also list the sizes of all the data structures:
<p>
<pre>
    x86_64$ pahole --sizes linux-2.6/vmlinux | sort -k3 -nr | head -5
    tty_struct	1328	10
    vc_data	432	9
    request_queue	2272	8
    net_device	1536	8
    mddev_s	792	8
</pre>
<p>
The first field represents data structure name, the second represents
the current size of the data structure and the final field represents
the number of holes present in the structure.
<p>
Similarly, to get the summary of possible data structure that can be
packed to save the size of the data structure:
<p>
<pre>
    x86_64$ pahole --packable sizes.o 
    sample	40	24	16
</pre>
<p>
The first field represents the data structure, the second represents
the current size, the third represents the packed size and the fourth
field represents the total number of bytes saved by packing the holes.
<p>
<h4>Pfunct</h4>
<p>
The pfunct tool shows the function aspects in the object code. It is
capable of showing the number of goto labels used, number of
parameters to the functions, the size of the functions etc. Most
popular usage however is finding the number of functions declared inline but
not inlined, or the number of function declared uninlined but are
eventually inlined. The compiler tends to optimize the functions by
inlining or uninlining the functions depending on the size.
<p>
<pre>
    x86_64$ pfunct --cc_inlined linux-2.6/vmlinux | tail -5
    run_init_process
    do_initcalls
    zap_identity_mappings
    clear_bss
    copy_bootdata
</pre>
<p>
The compiler may also choose to uninline functions which have been
specifically declared inline. This may be caused by multiple
reasons, such as recursive functions for which inlining will cause
infinite regress. <tt>pfunct --cc_uninlined</tt> shows functions which are
declared inline but have been uninlined by the compiler. Such functions are
good 
candidates for a second look, or for removing the inline declaration altogether.
Fortunately, <tt>pfunct --cc_uninlined</tt> on vmlinux (only) did not list 
any functions.

<p>
<h4> Debug Info </h4>
<p>
The utilities rely on the debug_info section of the object file, when
the source code is compiled using the debug option. These utilities
rely on the <a href="http://dwarfstd.org">DWARF standard</a> or <a
href="http://opensolaris.org/os/project/ppc-dev/task_map/ctf">Compact
C-Type Format (CTF)</a> which are common debugging file format used by
most compilers. Gcc uses the DWARF format. 
<p>
The debugging data is organized under the debug_info section of ELF
(Executable and Linkage Format), in the form of tags with values such
as  representing variables, parameters of a function, placed in
hierarchical nested format. To read raw information, you may use
readelf provided by binutils, or eu-readelf provided by elfutils.
Common standard distributions do not compile the packages with
debuginfo because it tends to make the binaries pretty big. Instead
they include this information as debuginfo packages, which
contain the debuginfo information which can be analyzed through these
tools or gdb.
<p>
Utilities discussed in this article were initially developed to
analyze kernel object files. However, these utilities are not limited to kernel
object files and can be used with any userspace programs generating
debug information. The source code of pahole utilities are maintained at
git://git.kernel.org/pub/scm/linux/kernel/git/acme/pahole.git
More information about pahole and other utilities to analyze debug
object files can be found in the <a
href="http://oops.ghostprotocols.net:81/acme/7dwarves.pdf">PDF about 7
dwarves</a>.<br clear="all"><table class="IndexEntries">
           <tr><th colspan=2>Index entries for this article</th></tr>
           <tr><td><a href="/Kernel/Index">Kernel</a></td><td><a href="/Kernel/Index#Development_tools">Development tools</a></td></tr>
            <tr><td><a href="/Archives/GuestIndex/">GuestArticles</a></td><td><a href="/Archives/GuestIndex/#Rodrigues_Goldwyn">Rodrigues, Goldwyn</a></td></tr>
            </table><br clear="all">
<hr width="60%%" align="left">
            <form action="/Login/" method="post">
            <input type="hidden" name="target" value="/Articles/335942/" />
            <input type="submit" name="login" value="Log in" /> to post comments
            <p>
        
</div> <!-- ArticleText -->
<p><a name="Comments"></a>
<a name="CommAnchor338024"></a>
    <details class="CommentBox" open>
      <summary><h3 class="CommentTitle">Poke-a-hole and friends</h3>
      <div class="AnnLine">
      <p class="CommentPoster"> Posted Jun 20, 2009 11:08 UTC (Sat)
                               by <b>sigra</b> (guest, #57156)
                              [<a href="/Articles/338024/">Link</a>] (2 responses)
      </p>
      
      </div>
      </summary>
      <div class="FormattedComment">
Is this mature enough yet to be let loose on a whole application, to find <br>
things that could easily be optimized? Something that could be run along <br>
with cppcheck, krazy2 and other tools that a project may have integrated. <br>
Does it have 0 false positives? Does it work for C++?<br>
</div>

      
          <div class="CommentReplyButton">
            <form action="/Articles/338024/comment" method="post">
            <input type="submit" value="Reply to this comment">
            </form>
          </div>
        
     <p>
     
    <a name="CommAnchor338060"></a>
    <details class="CommentBox" open>
      <summary><h3 class="CommentTitle">Poke-a-hole and friends</h3>
      <div class="AnnLine">
      <p class="CommentPoster"> Posted Jun 21, 2009 9:22 UTC (Sun)
                               by <b>tdz</b> (subscriber, #58733)
                              [<a href="/Articles/338060/">Link</a>] 
      </p>
      
      </div>
      </summary>
      <div class="FormattedComment">
I use pahole for some of my programs and really like it. Thanks to Arnaldo Carvalho de Melo for making this little gem available.<br>
<p>
Regards, Thomas<br>
<p>
</div>

      
          <div class="CommentReplyButton">
            <form action="/Articles/338060/comment" method="post">
            <input type="submit" value="Reply to this comment">
            </form>
          </div>
        
     <p>
     
    </details>
<a name="CommAnchor338113"></a>
    <details class="CommentBox" open>
      <summary><h3 class="CommentTitle">Poke-a-hole and friends</h3>
      <div class="AnnLine">
      <p class="CommentPoster"> Posted Jun 22, 2009 19:33 UTC (Mon)
                               by <b>acme</b> (subscriber, #2443)
                              [<a href="/Articles/338113/">Link</a>] 
      </p>
      
      </div>
      </summary>
      <div class="FormattedComment">
Most of the time it was used in C codebases, but it support most C++ constructs.<br>
<p>
The most recent activity is in fact related to C++: holes are being miscalculated after ancestor classes due to the way this info is being encoded by gcc: base classes sometimes are just forward declared in the debug section for an object file, so one can't find its size.<br>
<p>
See the current discussion in the dwarves mailing list at:<br>
<p>
<a href="http://article.gmane.org/gmane.comp.debugging.dwarves/109">http://article.gmane.org/gmane.comp.debugging.dwarves/109</a><br>
<p>
Please feel free to submit problems, I seldom write C++ code so C++ support in the dwarves comes from interacting with people trying to use it, like in past interactions with developers from KDE, CERN, Mozilla, etc.<br>
</div>

      
          <div class="CommentReplyButton">
            <form action="/Articles/338113/comment" method="post">
            <input type="submit" value="Reply to this comment">
            </form>
          </div>
        
     <p>
     
    </details>
</details>
<a name="CommAnchor338061"></a>
    <details class="CommentBox" open>
      <summary><h3 class="CommentTitle">Poke-a-hole and friends</h3>
      <div class="AnnLine">
      <p class="CommentPoster"> Posted Jun 21, 2009 11:27 UTC (Sun)
                               by <b>johill</b> (subscriber, #25196)
                              [<a href="/Articles/338061/">Link</a>] 
      </p>
      
      </div>
      </summary>
      <div class="FormattedComment">
<font class="QuotedText">&gt; pfunct --cc_inlined shows functions which are declared inline but have been uninlined by the compiler. Such functions are good candidates for a second look, or for removing the inline declaration altogether. Fortunately, pfunct --cc_uninlined on vmlinux (only) did not list any functions.</font><br>
<p>
I think that should be 'pfunct --cc_unlinined' in both instances, rather than just the second.<br>
</div>

      
          <div class="CommentReplyButton">
            <form action="/Articles/338061/comment" method="post">
            <input type="submit" value="Reply to this comment">
            </form>
          </div>
        
     <p>
     
    </details>
</div> <!-- middlecolumn -->
<div class="rightcol not-print">
<div id="azk93271_right_zone"></div>
</div>
</div> <!-- maincolumn -->

            <br clear="all">
            <center>
            <P>
            <span class="ReallySmall">
            Copyright &copy; 2009, Eklektix, Inc.<BR>
            
            Comments and public postings are copyrighted by their creators.<br>
            Linux  is a registered trademark of Linus Torvalds<br>
            </span>
            </center>
            
            </body></html>
